app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"
---
  def index
    @tools = Tool.all

SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @tool = Tool.find(params[:id])

INSERT INTO "tools" ("name", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Stapler"], ["price", 18.0], ["quantity", 10], ["created_at", "2016-05-25 17:43:24.420230"], ["updated_at", "2016-05-25 17:43:24.420230"]]
---
  def create
    @tool = Tool.new(tool_params)
    if @tool.save

SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT 1  [["id", 7]]
---
  def edit
    @tool = Tool.find(params[:id])

SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "tools" SET "price" = ?, "updated_at" = ? WHERE "tools"."id" = ?  [["price", 18.11], ["updated_at", "2016-05-25 17:50:17.327381"], ["id", 7]]
---
  def update
    @tool = Tool.find(params[:id])
    if @tool.update(tool_params)

SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "tools" WHERE "tools"."id" = ?  [["id", 6]]
---
  def destroy
    @tool = Tool.find(params[:id])
    @tool.destroy